from decouple import config

PORT = config("PORT", cast=int, default=5000)
BOT_TOKEN = config("BOT_TOKEN", cast=str)
PUBLIC_URL = config("PUBLIC_URL", cast=str)
DATABASE_URL = config("DATABASE_URL", cast=str)
RESOURCE_URL = config("RESOURCE_URL", cast=str)
DB_NAME = config("DB_NAME", cast=str)


CURRENCIES = {
    "usd": ":us:",
    "eur": ":eu:",
    "gbp": ":uk:",
    "pln": ":poland:",
    "chf": ":switzerland:",
    "nok": ":norway:",
    "jpy": ":jp:",
    "dkk": ":denmark:",
    "cny": ":flag_for_China:",
    "cad": ":canada:",
    "huf": ":hungary:",
    "czk": ":czech_republic:",
}

AVAILABLE_SETTINGS = [
        ("Set Up View", "customize_view"),
        ("Set Up Ordering", "customize_ordering"),
        ("Set Up Banks", "customize_bank")
    ]

VIEW_SETTINGS = [
    ("Yes", "Yes"),
    ("No", "No")
]

ORDERING_SETTINGS = [
    ("Default", "Default"),
    ("Cash(Bit) ASC", "Cash(Bit) ASC"),
    ("Cash(Bit) DESC", "Cash(Bit) DESC"),
    ("Cash(Ask) ASC", "Cash(Ask) ASC"),
    ("Cash(Ask) DESC", "Cash(Ask) DESC"),
]
AVAILABLE_BANKS = [
    ("Приватбанк", "Приватбанк"),
    ("Ощадбанк", "Ощадбанк"),
    ("Укрексімбанк", "Укрексімбанк"),
    ("Райффайзен Банк", "Райффайзен Банк"),
    ("Укргазбанк", "Укргазбанк"),
    ("ПУМБ", "ПУМБ"),
    ("Альфа-Банк", "Альфа-Банк"),
    ("OTP Bank", "OTP Bank"),
    ("Універсал Банк", "Універсал Банк"),
    ("Кредобанк", "Кредобанк"),
    ("БТА Банк", "БТА Банк"),
    ("Кліринговий Дім", "Кліринговий Дім"),
    ("А-Банк", "А-Банк"),
    ("Акордбанк", "Акордбанк"),
    ("Таскомбанк", "Таскомбанк"),
    ("Скай Банк", "Скай Банк"),
    ("Банк Львів", "Банк Львів"),
    ("Альянс Банк", "Альянс Банк"),
    ("Укрбудінвестбанк", "Укрбудінвестбанк"),
    ("Міжнародний Інвестиційний Банк", "Міжнародний Інвестиційний Банк"),
    ("РВС Банк", "РВС Банк"),
    ("Піреус Банк", "Піреус Банк"),
    ("Юнекс Банк", "Юнекс Банк"),
    ("Банк 3/4", "Банк 3/4"),
    ("ОКСІ Банк", "ОКСІ Банк"),
    ("Креді Агріколь Банк", "Креді Агріколь Банк"),
    ("Айбокс Банк (АгроКомБанк)", "Айбокс Банк (АгроКомБанк)"),
    ("Південний", "Південний"),
    ("Європромбанк", "Європромбанк"),
    ("Траст-капітал", "Траст-капітал"),
    ("Індустріалбанк", "Індустріалбанк"),
    ("Банк Кредит Дніпро", "Банк Кредит Дніпро"),
    ("Асвіо Банк", "Асвіо Банк"),
    ("Комінвестбанк", "Комінвестбанк"),
    ("Кредитвест Банк", "Кредитвест Банк"),
    ("Альтбанк (Неос банк (Банк Кіпру))", "Альтбанк (Неос банк (Банк Кіпру))"),
    ("Правекс Банк", "Правекс Банк"),
    ("Грант", "Грант"),
    ("Радабанк", "Радабанк"),
    ("Кристалбанк", "Кристалбанк"),
    ("Банк інвестицій та заощаджень", "Банк інвестицій та заощаджень"),
    ("Комерційний Індустріальний Банк", "Комерційний Індустріальний Банк"),
    ("Глобус", "Глобус"),
    ("Мотор-Банк", "Мотор-Банк"),
    ("Полікомбанк", "Полікомбанк"),
    ("Перший інвестиційний Банк", "Перший інвестиційний Банк"),
    ("Кредит Європа Банк", "Кредит Європа Банк"),
    ("МТБ Банк", "МТБ Банк"),
    ("Метабанк", "Метабанк"),
    ("Ідея Банк", "Ідея Банк"),
    ("Агропросперіс Банк", "Агропросперіс Банк"),
    ("Альпарі Банк", "Альпарі Банк"),
    ("Форвард Банк (Forward Bank)", "Форвард Банк (Forward Bank)"),
    ("Конкорд", "Конкорд"),
    ("Полтава-Банк", "Полтава-Банк"),
    ("Восток Банк", "Восток Банк"),
    ("Прокредит Банк", "Прокредит Банк"),
    ("Monobank", "monobank"),
]
